const initialState = {
  started: 0,
  final: 0,
  finalMessages: [
    {
      id: 'noneco',
      title: 'Екзамен не складено!',
      content: '<p>Нам дуже прикро, бо цей екзамен надзвичайно важливий.</p>' +
        '<p>Це не просто оцінка в атестаті, а характеристика вашого способу життя. Якщо ми не дбатимемо про екологію, то скоро нам не буде чим дихати, не буде чистої води і незасмічених земель.</p>' +
        '<p>В Україні звалища займають 9 000 гектарів, вони перевантажені і не відповідають екологічним нормам. 3 000 000 000 тонн відходів (22% від усіх) щороку викидають на несанкціоновані звалища.</p>' +
        '<p>Може, пора переглянути деякі принципи життя? Дбати про екологію не так важко, як видається. Варто тільки почати.</p>',
    },
    {
      id: 'worm',
      title: 'Ви склали екзамен! Ми раді, що ви дбаєте про нашу планету.',
      content: '<p>Хочу похвалити ваші знання у сфері органічних відходів.</p>' +
        '<p>Здавалося б, що може бути природніше за органіку? Але велике місто продукує багато органіки, і коли вона змішується з іншими відходами на звалищах, то приємного мало.</p>' +
        '<p>Мабуть, ви уже опанували або збираєтеся опанувати технологію компостування. Як експерт у цій галузі бажаю вам успіхів! Бережімо наш спільний дім!</p>',
    },
    {
      id: 'spider',
      title: 'Ви склали екзамен! Ми раді, що ви дбаєте про нашу планету.',
      content: '<p>Екологія починається з порядку.</p>' +
        '<p>Усе має бути посортовано і розподілено! Для відходів це дуже актуально. 94 % усіх відходів в Україні просто захоронюють на звалищах. Але вам це не подобається, у вас вдома, мабуть, є різні контейнери для паперу, пластику, скла, бляшанок та органіки, чи не так?</p>' +
        '<p>Вам дуже прикро, що такі відходи як чеки, паперові стаканчики для кави (містять пластик) чи паперові лотки для яєць не піддаються переробці. Мені також. Сподіваюся, разом ми змінимо ситуацію. Я працюю над цим усіма лапками.</p>',
    },
    {
      id: 'mermaid',
      title: 'Ви склали екзамен! Ми раді, що ви дбаєте про нашу планету.',
      content: '<p>Буль-буль!</p>' +
        '<p>Як же я мрію дихати на повні груди під водою і не боятися вдавитися відходами. Пластик і хімікати отруюють водні багатства нашої планети. </p>' +
        '<p>Ну, добре, я тут живу, і це моя домівка, але люди також не обходяться без води. Що ви будете пити, коли засмітите всю воду? </p>' +
        '<p>Добре, що існують такі, як ви, що дбають про воду та її мешканців. Ми вам дуже вдячні. Шкода, що не всі люди такі.</p>',
    },
    {
      id: 'robot',
      title: 'Ви склали екзамен! Ми раді, що ви дбаєте про нашу планету.',
      content: '<p>Усі члени комісії хотіли вас похвалити, але я скористаюся правом голови і сам підсумую похвали колег: Ви чудово усвідомлюєте важливість мінімізації відходів.</p>' +
        '<p>Ви дбаєте про чистоту ґрунту, води і повітря. Відповідально ставитеся до ресурсів, споживаєте з розумом. Для вас це не порожні слова, а частина життя.</p>' +
        '<p>Так тримати! Ви живете за принципом 5R і отримуєте від нас п’ятірку!</p>',
    },
    {
      id: 'pigeon',
      title: 'Ви склали екзамен! Ми раді, що ви дбаєте про нашу планету.',
      content: '<p>Буває, лечу собі над містом і тут бамц – будинок. Кілька разів дзьоб собі мало не зламав. Із зором у мене проблем нема. Стаж літання – чотири роки.</p>' +
        '<p>Знаєте, у чому проблема? Я нічогісінько не бачу через смог. Ніколи не курив, але все одно кашляю. Втік би з міста давно, але це моя домівка.</p>' +
        '<p>Я радий, що ви намагаєтеся виправити ситуацію і мінімізуєте забруднення повітря. Якщо колись вам поставлять пам’ятник, то голуби оминатимуть його, обіцяю!</p>',
    },
  ],
  currentQuestion: null,
  votes: {
    noneco: 0,
    robot: 0,
    spider: 0,
    worm: 0,
    mermaid: 0,
    pigeon: 0,
  },
  heroes: [
    {
      id: 'robot',
      title: 'робот Zero',
      desc: 'голова комісії, заслужений мінімізатор відходів',
      image: 'images/robot.png',
      text: '<p>Привіт, я спеціальний сміттєзменшувальний робот Zero. І моя місія зробити так, щоб ваш смітник став меншим, ще меншим, іще меншим, і зовсім малесеньким. І це можливо!</p><p>Споживай розумно, сортуй відходи, уникай одноразових упаковок, і щодня зменшуй обсяг того, що летить у смітник.</p>'
    },
    {
      id: 'spider',
      title: 'павучиха Поля',
      desc: 'експертка із сортування сміття',
      image: 'images/spider.png',
      text: '<p>Привіт! Можете мене не боятися, я просто прекрасна леді. Ходжу собі, плету павутину, багато бачу, багато чую і вмію ультрашвидко величезні гори непотребу перетворювати на купки корисних відходів. Я Поля, просто супервправна Поліна.</p><p>Ви знали, що кожен з вас лише за один рік лишає таку чималу гору відходів вагою в 300 кілограмів?! Більшу частину цієї гори можна і потрібно відправляти в подорож до нового життя. </p><p>Робити це просто, головне звичка, навіть не треба бути такою ультравправною павучихою, як я. Просто щоразу, як маєш намір викинути щось у смітник, подумай, чи може воно перетворитися на щось корисне?</p>'
    },
    {
      id: 'worm',
      title: 'черв’як Леонід',
      desc: 'кандидат у майстри компостування',
      image: 'images/worm.png',
      text: '<p>Добрий день, поважне товариство, я черв’як Леонід, і ваші відходи – це моя справа. Це я разом з колегами, можу легко і невимушено, ба, навіть із задоволенням перетворити чималу купу органічних відходів на гумус. А гумус – це саме та штука, яка збагачує землю так, що з неї ростуть найсмачніші у світі помідори, найхрумкіші у світі огірочки і найкрасивіші у світі квіті.</p><p>Це саме я можу перетворити відходи в красу!</p>'
    },
    {
      id: 'mermaid',
      title: 'русалка Марина',
      desc: 'водяний<br />еко-аудитор',
      image: 'images/mermaid.png',
      text: '<p>Привіт, я русалонька Марина. Запрошую тебе до себе в гості. Океан – це мій дім, і він неймовірно прекрасний, сильний, потужний. Єдине, що його вбиває, це відходи, які ти бездумно кидаєш у загальну купу непотребу. Лише за рік, кожна 4 твоя пластикова пляшка чи пакет збільшують великий отруйний острів з відходів у моєму океані.</p><p>Здавай пластик на переробку – збережи красу нашого дому!</p>'
    },
    {
      id: 'pigeon',
      title: 'голуб Роберт',
      desc: 'інспектор чистого повітря',
      image: 'images/pigeon.png',
      text: '<p>Привіт, я Роберт, голуб Роберт, найбільш за все я люблю злітати високо у ранкове прозоре небо. Але, кхе-кхе, дим, кхе-кхе. Люди постійно спалюють листя, траву, відходи, і тоді, замість гарного весняного неба, можна побачити лише чорні стовпи отруйного диму.</p><p>Людям здається, що вогонь найкращий спосіб переробки відходів. І забувають, що лише один пластиковий пакетик у вогнищі перетворює повітря на отруйний коктейль. До того ж, я не розумію, навіщо спалювати те, що приносить користь? Сухе листя і торішня трава досить швидко перетворюються на корисний гумус, а решту відходів можна здати на утилізацію.</p>'
    },
  ],
  questions: [
    {
      id: 1,
      title: 'Ви з друзями пішли на пікнік і взяли з собою продукти. Що ви зробите з упаковками?',
      answers: [
        {
          id: 1,
          title: 'Дбайливо спалите у вогнищі.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 2,
          title: 'Прикопаєте землею.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 3,
          title: 'Зберете, розсортуєте і здасте в пункти прийому.',
          affect: 'spider',
          value: 1
        },
        {
          id: 4,
          title: 'Візьмете продукти без упаковок у власних багаторазових контейнерах.',
          affect: 'robot',
          value: 1
        },
      ]
    },
    {
      id: 2,
      title: 'Зів’ялі квіти, шкаралупа з яєць та кавова гуща. Що з цим зробити?',
      answers: [
        {
          id: 1,
          title: 'Усе це можна переробити у компостному контейнері.',
          affect: 'worm',
          value: 1
        },
        {
          id: 2,
          title: 'Це усе органічні відходи, тому їх можна викидати з вікна.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 3,
          title: 'Перераховані відходи можна спалити разом із сухим листям, але це шкідливо для атмосфери.',
          affect: 'pigeon',
          value: 1
        },
        {
          id: 4,
          title: 'Це явно треба відсортувати від пластику та інших відходів, які переробляються.',
          affect: 'spider',
          value: 1
        },
      ]
    },
    {
      id: 3,
      title: 'Ідучи набережною, ви саме допили напій. Що ви зробите з порожньою пляшкою?',
      answers: [
        {
          id: 1,
          title: 'Викинете у річку.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 2,
          title: 'Спресуєте, закинете у торбу і при нагоді здасте у пункт прийому.',
          affect: 'spider',
          value: 1
        },
        {
          id: 3,
          title: 'Викинете у найближчий смітник.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 4,
          title: 'Пригрозите порожньою пляшкою перехожому, що збирається викинути недопалок у річку.',
          affect: 'mermaid',
          value: 1
        },
      ]
    },
    {
      id: 4,
      title: 'За підрахунками Міжурядової комісії зі зміни клімату, на звалищах світу з органічних відходів утворюється 40 млн. тонн метану на рік. Як з цим боротися?',
      answers: [
        {
          id: 1,
          title: 'Спалювати відходи одразу, не захоронюючи.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 2,
          title: 'Відсортовувати органічні відходи і переробляти їх за допомогою компостування.',
          affect: 'worm',
          value: 1
        },
        {
          id: 3,
          title: 'Розбити великі звалища на віддалені групи менших звалищ.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 4,
          title: 'Закопувати відходи глибоко в землю.',
          affect: 'noneco',
          value: 1
        },
      ]
    },
    {
      id: 5,
      title: 'Які мийні засоби ви використовуєте?',
      answers: [
        {
          id: 1,
          title: 'Різноманітні мийні засоби, упаковки від яких викидаю у смітник.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 2,
          title: 'Користуюся оцтом (зі скляної тари) та содою (з паперової), мені вистачає.',
          affect: 'robot',
          value: 1
        },
        {
          id: 3,
          title: 'Екологічні мийні засоби, упаковки від яких здаю на переробку.',
          affect: 'spider',
          value: 1
        },
        {
          id: 4,
          title: 'Намагаюся обмежити кількість мийних засобів, щоб було менше пластику та фосфатів у водоймах.',
          affect: 'mermaid',
          value: 1
        },
      ]
    },
    {
      id: 6,
      title: 'Як ви освітлюєте своє помешкання?',
      answers: [
        {
          id: 1,
          title: 'Лампочками розжарювання, які потім викидаю у смітник.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 2,
          title: 'Люмінісцентними лампочками, які здаю на переробку.',
          affect: 'pigeon',
          value: 1
        },
        {
          id: 3,
          title: 'Лампочками LED, які здаю на переробку.',
          affect: 'robot',
          value: 1
        },
        {
          id: 4,
          title: 'Використовую гасові лампи.',
          affect: 'noneco',
          value: 1
        },
      ]
    },
    {
      id: 7,
      title: 'На дачі назбиралося багато листя. Що з ним робити?',
      answers: [
        {
          id: 1,
          title: 'Засипати в компостну яму.',
          affect: 'worm',
          value: 1
        },
        {
          id: 2,
          title: 'Спалити.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 3,
          title: 'Скинути у річку.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 4,
          title: 'Викинути на звалище.',
          affect: 'noneco',
          value: 1
        },
      ]
    },
    {
      id: 8,
      title: 'Яким транспортом ви користуєтеся в місті?',
      answers: [
        {
          id: 1,
          title: 'Всюди їжджу на машині/таксі, навіть на малі відстані.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 2,
          title: 'Користуюся громадським транспортом, іноді машиною/таксі.',
          affect: 'spider',
          value: 1
        },
        {
          id: 3,
          title: 'Планую купити/купив електрокар, щоб не забруднювати атмосферу.',
          affect: 'pigeon',
          value: 1
        },
        {
          id: 4,
          title: 'Тільки велосипедом або пішки.',
          affect: 'robot',
          value: 1
        },
      ]
    },
    {
      id: 9,
      title: 'Наскільки дбайливо ставитеся до води?',
      answers: [
        {
          id: 1,
          title: 'Води у нас багато, ми не в пустелі живемо.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 2,
          title: 'Вода дешева, це ж не газ, навіщо її економити?',
          affect: 'noneco',
          value: 1
        },
        {
          id: 3,
          title: 'Ванну не приймаю, миюся в душі.',
          affect: 'mermaid',
          value: 1
        },
        {
          id: 4,
          title: 'Пральна машинка класу А+++, економний розпилювач на душі і кранах, приймаю душ замість ванни.',
          affect: 'robot',
          value: 1
        },
      ]
    },
    {
      id: 10,
      title: 'Ви йдете на день народження і…',
      answers: [
        {
          id: 1,
          title: 'Купуєте квіти, загорнуті у пластик.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 2,
          title: 'Купуєте квіти без пластикової обгортки.',
          affect: 'mermaid',
          value: 1
        },
        {
          id: 3,
          title: 'Замість квітів купуєте вазон, бо він виробляє кисень.',
          affect: 'pigeon',
          value: 1
        },
        {
          id: 4,
          title: 'Не купую квітів, бо практикую мінімалізм.',
          affect: 'robot',
          value: 1
        },
      ]
    },
    {
      id: 11,
      title: 'Які з цих відходів приймають на переробку в Україні?',
      answers: [
        {
          id: 1,
          title: 'Чеки з магазинів.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 2,
          title: 'Паперові стаканчики з-під кави.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 3,
          title: 'Tetra Pak упаковки.',
          affect: 'spider',
          value: 1
        },
        {
          id: 4,
          title: 'Паперові лотки з-під яєць.',
          affect: 'noneco',
          value: 1
        },
      ]
    },
    {
      id: 12,
      title: 'Які з цих продуктів підлягають компостуванню?',
      answers: [
        {
          id: 1,
          title: 'М’ясо і риба.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 2,
          title: 'Шкірка цитрусових.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 3,
          title: 'Паперові серветки.',
          affect: 'worm',
          value: 1
        },
        {
          id: 4,
          title: 'Фекалії домашніх тварин.',
          affect: 'noneco',
          value: 1
        },
      ]
    },
    {
      id: 13,
      title: 'Яка ікра найбільш екологічна?',
      answers: [
        {
          id: 1,
          title: 'Чорна.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 2,
          title: 'Червона.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 3,
          title: 'Кабачкова.',
          affect: 'mermaid',
          value: 1
        },
        {
          id: 4,
          title: 'Ікра мойви.',
          affect: 'noneco',
          value: 1
        },
      ]
    },
    {
      id: 14,
      title: 'Чи великий у вас гардероб?',
      answers: [
        {
          id: 1,
          title: 'У мене три шафи і вони ледь зачиняються.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 2,
          title: 'Стежу за тенденціями моди і купую новий одяг раз на сезон.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 3,
          title: 'Намагаюся мінімізувати кількість одягу.',
          affect: 'robot',
          value: 1
        },
        {
          id: 4,
          title: 'Не можу втриматися, коли бачу акційні пропозиції на одяг.',
          affect: 'noneco',
          value: 1
        },
      ]
    },
    {
      id: 15,
      title: 'Чим корисний принцип споживання 5R – refuse, reduce, reuse, recycle, rot (тобто відмовляйся, зменшуй, використовуй знову, здавай на переробку і компостуй)?',
      answers: [
        {
          id: 1,
          title: 'За допомогою цих правил можна мінімізувати відходи.',
          affect: 'robot',
          value: 1
        },
        {
          id: 2,
          title: 'Гроші можна зекономити, щоб купити позашляховик.',
          affect: 'noneco',
          value: 1
        },
        {
          id: 3,
          title: 'Повітря стане чистішим.',
          affect: 'pigeon',
          value: 1
        },
        {
          id: 4,
          title: 'Органічні відходи перероблятимуться ефективно і безпечно.',
          affect: 'worm',
          value: 1
        },
      ]
    },
  ],
  gameInfo: {
    title: 'Правила',
    text: '<p>Експерти підготували 15 питань з чотирма варіантами відповідей. У деяких питаннях вам може здатися, що кілька відповідей правильні. Так і є. Але вам треба обрати одну, найближчу до вашого світогляду. Це допоможе нам визначити, про яку сферу екології ви дбаєте найкраще.</p><p>Сім неекологічних відповідей – екзамен провалено.</p><p>Екологічних відповідей більше за вісім – ви склали екзамен, і на вас чекає похвала від члена журі.</p><p>А якщо ви зуби з’їли на екологічності, то вас похвалить сам голова комісії робот Зеро, заслужений мінімізатор відходів.</p>'
  }
};

export default (state = initialState, action) => {
  switch (action.type) {
    case "INIT":
      return {
        ...state
      };
    case "START":
      return {
        ...state,
        name: action.name
      };
    case "START_GAME":
      return {
        ...state,
        started: 1
      };
    case "GET_QUESTION":
      const questions = [...state.questions];
      const el = questions.shift();
      return {
        ...state,
        questions,
        currentQuestion: el ? el : null,
        final: (questions.length === 0 && !el) ? 1 : 0
      };
    case "SET_VOTE":
      const { affect, value } = action;
      const votes = Object.assign({}, state.votes);

      votes[affect] = parseInt(votes[affect]) + parseInt(value);
      return {
        ...state,
        votes
      };
    default:
      return state;
  }
};
